import Heading from "../../components/Heading/Heading";
import Layout from "../../layout/layout";
import styles from "./sass/OfferContractView.module.scss";
const OfferContractView = () => {
  return (
    <Layout>
      <section>
        <div>
          <Heading text="Договір публічної оферти" />
          <ol>
            <li className={styles.list}>
              <strong className={styles.head}>Загальні положення.</strong>
            </li>
          </ol>
          <p className={styles.text}>
            Веб-сайт https://SushiRaketa.com.ua/ (далі – Продавець), публікує
            цей договір, який є публічним договором-офертою (далі Договір) та
            має відповідну юридичну силу, про продаж товарів, представлених на
            офіційному інтернет-сайті Продавця адресу як фізичних, і юридичних
            (далі Покупець).
          </p>
          <p className={styles.text}>
            Відповідно до статей 633, 641, 642 Цивільного Кодексу України (далі
            – ЦКУ) та Правил продажу товарів на замовлення та поза торговельними
            або офісними приміщеннями, затвердженими наказом Міністерства
            економіки України від 19.04.2007 №103, цей документ є офертою, а
            факт вчинення Покупцем замовлення, в усній (за телефоном або в
            магазині, офісі) або письмовій (через сайт або електронну пошту)
            формі та отримання цього замовлення Продавцем – є повним та
            безумовним прийняттям даного публічного договору та інформації,
            викладеної на сайті.
          </p>
          <p className={styles.text}>
            Використання послуг та купівля товарів, послуг Веб-сайт
            https://SushiRaketa.com.ua/ передбачає згоду особи, яка користується
            послугами або купує товар з правилами, термінами, обмеженнями та
            іншими умовами співробітництва, викладеними в цьому документі
          </p>
          <p className={styles.text}>
            Приймаючи цей договір, Покупець підтверджує, що:
          </p>
          <p className={styles.text}>
            А) на момент придбання товару йому виповнилося 18 років;
          </p>
          <p className={styles.text}>
            Б) інформація, що надається при замовленні товарів чи послуг, є
            правильною та актуальною;
          </p>
          <p className={styles.text}>
            В) надана контактна інформація може бути використана з метою
            інформування про зміни в роботі, акційні пропозиції або іншу
            інформацію, {"пов'язану"} з діяльністю продавця.
          </p>
          <p className={styles.text}>
            На підставі вищесказаного, уважно ознайомтеся з цим договором
            (публічною офертою) і якщо ви не погоджуєтесь з будь-яким з пунктів
            оферти, будь ласка, залиште сайт
          </p>
          <p className={styles.text}>
            У цьому Договорі, якщо зміст не вимагає іншого, терміни слід
            тлумачити так:
          </p>
          <p className={styles.text}>
            <strong>«Оферта»</strong> – публічна пропозиція Продавця, адресована
            будь-якій фізичній та юридичній особі, з метою укласти договір
            купівлі-продажу на існуючих умовах, зазначених у Договорі.
          </p>
          <p className={styles.text}>
            <strong>«Товар»</strong> – перелік найменувань асортименту,
            представлений на офіційному сайті Продавця, але не обмежується лише
            сайтом.
          </p>
          <p className={styles.text}>
            <strong>«Продавець»</strong> – компанія, що реалізує Товар,
            представлений на Веб-сайті, але не обмежується тільки сайтом.
          </p>
          <p className={styles.text}>
            <strong>«Покупець»</strong> – фізична чи юридична особа, яка
            вступила в договірні відносини з Продавцем на умовах, зазначених у
            Договорі.
          </p>
          <p className={styles.text}>
            <strong>«Акцепт»</strong> – повне та беззаперечне прийняття Покупцем
            умов Договору.
          </p>
          <p className={styles.text}>
            <strong>«Замовлення»</strong> – окремі позиції з асортиментного
            переліку Товару, зазначені Покупцем під час розміщення заявки на
            інтернет-сайті Продавця або замовлені будь-яким іншим способом.
          </p>
          <p className={styles.text}>
            <strong>«{"Кур'єрська"} доставка»</strong> – безпосередня передача
            товару від продавця до Покупця незалежним підрядником, який надає
            послуги Продавцю відповідно до окремого укладеного договору.
            Продавець не здійснює самостійно доставку товару.
          </p>
          <p className={styles.text}>
            <strong>«Веб-сайт»</strong> – веб-сторінка продавця
            https://SushiRaketa.com.ua/
          </p>
          <p className={styles.text}>
            <strong>«Місце продажу Товару»</strong> – заклад комунального
            харчування (ресторан) Продавця.
          </p>
          <ol start={2}>
            <li className={styles.list}>
              <strong className={styles.head}>Предмет договору.</strong>
            </li>
          </ol>
          <p className={styles.text}>
            2.1. Продавець здійснює продаж Покупцю Товару, відповідно до чинних
            на момент здійснення замовлення цін, а Покупець має право сплатити
            та прийняти Товар відповідно до умов цього Договору.
          </p>
          <p className={styles.text}>
            2.2. Цей договір є офіційним документом Продавця та є{" "}
            {"невід'ємною"} частиною оферти.
          </p>
          <p className={styles.text}>
            2.3. Продаж товару здійснюється у установі Продавця.
          </p>
          <ol start={3}>
            <li className={styles.list}>
              <strong className={styles.head}>
                Момент укладання договору.
              </strong>
            </li>
          </ol>
          <p className={styles.text}>
            3.1. Текст договору є публічною офертою (відповідно до статей 633,
            643 Цивільного кодексу України та Правил продажу товарів на
            замовлення поза торговельними чи офісними приміщеннями,
            затвердженими наказом Міністерства економіки України від 19.04.2007
            №103).
          </p>
          <p className={styles.text}>
            3.2. Факт оформлення замовлення у Продавця, як самостійно, так і за
            допомогою оператора, є беззастережним прийняттям умов цього
            Договору, і Покупець надалі виступає як особа, яка набула договірних
            відносин. Покупець {"зобов'язується"} самостійно знайомитись з
            умовами договору, продавець не {"зобов'язаний"} інформувати Покупця
            про наявність договору.
          </p>
          <p className={styles.text}>
            3.3. Моментом вступу Покупця у договірні відносини з Продавцем
            вважається момент замовлення Товару, незважаючи на спосіб замовлення
            та форму оплати.
          </p>
          <p className={styles.text}>
            3.4. На письмову вимогу Покупця Продавець оформлює договір із
            підписами сторін.
          </p>
          <p className={styles.text}>
            3.5. Покупець самостійно та за власним бажанням {"пов'язується"} з
            продавцем, що означає, що Покупець ознайомився з цим договором та
            погоджується з ним.
          </p>
          <ol start={4}>
            <li className={styles.list}>
              <strong className={styles.head}> Ціна товару.</strong>
            </li>
          </ol>
          <p className={styles.text}>
            4.1. Ціни у Веб-сайті вказані в національній валюті України (гривня)
            за одиницю товару відповідно до існуючого прейскуранта.
          </p>
          <p className={styles.text}>
            4.2. Продавець залишає за собою право змінювати ціну товару до
            моменту оформлення замовлення без попередження покупця.
          </p>
          <p className={styles.text}>
            4.2. Продавець залишає за собою право змінювати ціну товару до
            моменту оформлення замовлення без попередження покупця.
          </p>
          <p className={styles.text}>
            4.4. Ціни, вказані на сайті https://SushiRaketa.com.ua/, мають
            ознайомлювальний характер.
          </p>
          <ol start={5}>
            <li className={styles.list}>
              <strong className={styles.head}> Оплата товару.</strong>
            </li>
          </ol>
          <p className={styles.text}>
            5.1. При готівковій формі оплати Покупець {"зобов'язаний"} сплатити
            Продавцю ціну товару у момент його передачі, якщо інше не
            передбачено домовленістю чи договором між сторонами.
          </p>
          <p className={styles.text}>
            5.2. Оплата товарів та послуг Веб-сайта https://SushiRaketa.com.ua/
            здійснюється в національній валюті України відповідно до цін та
            тарифів, встановлених на момент купівлі товарів або отримання
            послуг.
          </p>
          <p className={styles.text}>
            5.2. Оплата товарів та послуг Веб-сайта https://SushiRaketa.com.ua/
            здійснюється в національній валюті України відповідно до цін та
            тарифів, встановлених на момент купівлі товарів або отримання
            послуг.
          </p>
          <p className={styles.text}>
            5.3 Оплата товарів та послуг Веб-сайта https://SushiRaketa.com.ua/
            здійснюється відповідно до розділу «доставка, оплата та ціни»,
            опублікованому на сайті https://SushiRaketa.com.ua/. Оплата
            зараховується лише за умови дотримання порядку, опублікованому на
            сайті.
          </p>
          <p className={styles.text}>
            5.3 Оплата товарів та послуг Веб-сайта https://SushiRaketa.com.ua/
            здійснюється відповідно до розділу «доставка, оплата та ціни»,
            опублікованому на сайті https://SushiRaketa.com.ua/. Оплата
            зараховується лише за умови дотримання порядку, опублікованому на
            сайті.
          </p>
          <p className={styles.text}>
            5.4. У разі не оплати, неповної або несвоєчасної оплати Веб-сайт
            https://SushiRaketa.com.ua/ залишає за собою право ненадання товару,
            призупинення або повного невиконання взятих на себе {"зобов'язань"}{" "}
            та при цьому не несе відповідальності за можливі наслідки такого
            рішення/дій .
          </p>
          <p className={styles.text}>
            5.5. Товари та послуги гарантуються та надаються лише за фактом
            отримання оплати Веб-сайт https://SushiRaketa.com.ua/ (за наявності
            товару на момент фіксування оплати Продавцем у імпортера, фізичної
            наявності товару на складі продавця, можливості його доставки на
            склад Продавця або за адресою, вказаною Покупцем). На момент
            отримання оплати Веб-сайт https://SushiRaketa.com.ua/ не несе жодних
            {"зобов'язань"} перед Покупцем товарів та послуг, замовлених
            Продавцем.
          </p>
          <p className={styles.text}>
            5.6. При безготівковій формі оплати {"обов'язок"} Покупця щодо
            сплати вартості товару вважається виконаним з моменту зарахування
            відповідних коштів на розрахунковий рахунок Продавця.
          </p>
          <p className={styles.text}>
            5.7. При безготівковій формі розрахунку Покупець {"зобов'язаний"}{" "}
            {"пред'явити"} менеджеру чи {"кур'єру"} документ, що підтверджує
            факт оплати Товару (платіжне доручення, квитанція про сплату тощо).
          </p>
          <p className={styles.text}>
            5.8. Ціни на будь-які позиції Товару можуть змінюватись Продавцем в
            односторонньому порядку. У разі зміни ціни на замовлення позиції
            Товару до оплати Замовлення, Продавець {"зобов'язаний"} у
            найкоротший термін повідомити Покупця про такі зміни. Покупець має
            право підтвердити чи анулювати замовлення. У разі відсутності
            {" зв'язку"} з Покупцем Замовлення вважається анульованим протягом
            24 годин з моменту зміни ціни на товар.
          </p>
          <ol start={6}>
            <li className={styles.list}>
              <strong className={styles.head}> Доставка товару.</strong>
            </li>
          </ol>
          <p className={styles.text}>
            6.1. Покупець має право отримати замовлений ним товар за допомогою
            самостійного вивезення (самовивіз) із закладу громадського
            харчування (ресторану) Продавця, або скористатися послугами
            {" кур'єрської"} доставки. Продавець самостійно не здiйснює доставку
            замовленого Товару Покупцевi.
          </p>
          <p className={styles.text}>
            6.2. Самовивіз здійснюється Покупцем із закладу громадського
            харчування (ресторану) Продавця, який буде вказано у замовленні.
          </p>
          <p className={styles.text}>
            6.3. {"Кур'єрська"} доставка замовлення Покупцю здійснюється за
            погодженням з Покупцем та за вказаною ним адресою.
          </p>
          <p className={styles.text}>
            6.4. Доставка замовленого товару здійснюється в межах м. Київ, якщо
            інше не передбачено попередньою домовленістю між сторонами.
          </p>
          <ol start={7}>
            <li className={styles.list}>
              <strong className={styles.head}> Продаж товару та послуг.</strong>
            </li>
          </ol>
          <p className={styles.text}>
            7.1. Веб-сайт https://SushiRaketa.com.ua/ не гарантує безумовного
            виконання замовлення. Усі послуги та товари надаються за принципом
            {" 'як є'."} Задіяні технічні системи (веб-сторінка і сам сайт
            https://SushiRaketa.com.ua/) можуть включати невиявлені технічні
            помилки, наслідком яких є неможливість виконання замовлення, купівлі
            товару чи його невчасне Виконання. Крім того, до неможливості
            виконання замовлення або його несвоєчасного виконання можуть навести
            обставини, обумовлені людським фактором або обставини непереборної
            сили.
          </p>
          <p className={styles.text}>
            7.2. У разі неможливості або несвоєчасного виконання прийнятих на
            себе {"зобов'язань"} за обставин, викладених у п.7.1 (за винятком
            «форс-мажор») Веб-сайт https://SushiRaketa.com.ua/ несе
            відповідальність у межах сум, отриманих від клієнтів як оплати за
            товари чи послуги.
          </p>
          <p className={styles.text}>
            7.3. Веб-сайт https://SushiRaketa.com.ua/ не несе і за жодних
            обставин не може нести жодної матеріальної відповідальності, що
            виходить за межі сум, отриманих від клієнта як оплата за товари та
            послуги.
          </p>
          <p className={styles.text}>
            7.4. Веб-сайт https://SushiRaketa.com.ua/ залишає за собою право
            відмовити у наданні послуг або продажу товару Покупцю на свій
            розсуд.
          </p>
          <p className={styles.text}>
            7.5. Кошти, сплачені Покупцем, не повертаються в таких випадках:
          </p>
          <p className={styles.text}>
            А) відмова клієнта від отриманої послуги чи товару після оплати та
            отримання від {"кур'єра"};
          </p>
          <p className={styles.text}>Б) за рішенням суду;</p>
          <p className={styles.text}>В) якщо цей товар є належною якістю.</p>
          <p className={styles.text}>
            7.6. Місце продажу Товару є закладом комунального харчування
            (ресторан) Продавця.
          </p>
          <ol start={8}>
            <li className={styles.list}>
              <strong className={styles.head}>
                Відповідальність перед третіми особами.
              </strong>
            </li>
          </ol>
          <p className={styles.text}>
            8.1. Веб-сайт https://SushiRaketa.com.ua/ не несе жодної
            відповідальності за використання або подальше використання товарів
            та послуг, придбаних у Веб-сайті https://SushiRaketa.com.ua/ та за
            його допомогою.
          </p>
          <p className={styles.text}>
            8.2. Веб-сайт https://SushiRaketa.com.ua/ не несе відповідальності
            за зміст та якість, проданих товарів за умови наявності сертифікатів
            імпортера та документів, що підтверджують придбання даної продукції
            імпортера.
          </p>
          <ol start={9}>
            <li className={styles.list}>
              <strong className={styles.head}>
                Права та {"обов'язки"} сторін.
              </strong>
            </li>
          </ol>
          <p className={styles.text}>9.1. Продавець {"зобов'язується"}:</p>
          <p className={styles.text}>
            9.1.1. Не розголошувати будь-яку приватну інформацію Покупця та не
            надавати доступу до цієї інформації третім особам, за винятком
            випадків, передбачених чинним законодавством України.
          </p>
          <p className={styles.text}>
            9.1.2. Надати Покупцеві можливість отримання безкоштовних телефонних
            консультацій за телефонами, вказаними на сайті
            (https://SushiRaketa.com.ua/). Обсяг консультацій обмежується
            конкретними питаннями, {"пов'язаними"} із виконанням замовлення.
          </p>
          <p className={styles.text}>
            9.1.3. Продавець залишає за собою право невиконання замовлення у
            разі виникнення форс-мажорних обставин.
          </p>
          <p className={styles.text}>
            9.1.4. Продавець залишає за собою право змінювати цей Договір в
            односторонньому порядку до моменту його укладання.
          </p>
          <p className={styles.text}>
            9.2. Продавець не несе відповідальності за неналежне використання
            товарів Покупцем, замовлених на Веб-сайті.
          </p>
          <p className={styles.text}>
            9.3. Продавець має право передати свої права та {"обов'язки"} щодо
            виконання Замовлень третім особам.
          </p>
          <p className={styles.text}>
            9.4.1. До моменту звернення до Веб-сайту https://SushiRaketa.com.ua/
            ознайомитись із змістом Договору-оферти, умовами оплати та доставки
            на сайті магазину.
          </p>
          <p className={styles.text}>
            9.5. Право власності на замовлення, а також ризик його випадкового
            пошкодження або втрати переходять до Покупця з моменту передачі
            товару.
          </p>
          <ol start={10}>
            <li className={styles.list}>
              <strong className={styles.head}>Форс-мажорні обставини.</strong>
            </li>
          </ol>
          <p className={styles.text}>
            10.1. Сторони звільняються від відповідальності за невиконання або
            неналежне виконання {"зобов'язань"} за умовами договору на час дії
            непереборної сили. Під непереборною силою розуміються надзвичайні та
            непереборні за цих умов обставини, що перешкоджають виконання своїх
            {"зобов'язань"} сторонами за цим Договором. До них відносяться
            стихійні явища (землетруси, повені тощо), обставини суспільного
            життя (військові дії, надзвичайні положення, найбільші страйки,
            епідемії тощо), що забороняють заходи державних органів (заборона
            перевезень, валютні обмеження, міжнародні санкції, заборони торгівлю
            та інше). Протягом цього часу сторони не мають взаємних претензій і
            кожна зі сторін бере на себе ризик за результатами форс-мажорних
            обставин.
          </p>
          <ol start={11}>
            <li className={styles.list}>
              <strong className={styles.head}>Авторські права.</strong>
            </li>
          </ol>
          <p className={styles.text}>
            Вся текстова інформація та графічні зображення, розміщені на сайті
            Веб-сайту (https://SushiRaketa.com.ua/), є власністю продавця та/або
            його постачальників та виробників Товару.
          </p>
          <ol start={12}>
            <li className={styles.list}>
              <strong className={styles.head}>
                Інформація та її використання.
              </strong>
            </li>
          </ol>
          <p className={styles.text}>
            12.1. Покупець {"зобов'язаний"} надати точну та правдиву інформацію
            у кількості, необхідної для надання послуг та/або купівлі товару, що
            він отримує чи купує. Інформація, надана Покупцем, може бути
            опублікована у відкритих джерелах.
          </p>
          <p className={styles.text}>
            12.2. Веб-сайт https://SushiRaketa.com.ua/ має право на власний
            розсуд вимагати від Покупця документального підтвердження
            справжності наданої інформації.
          </p>
          <p className={styles.text}>
            12.3. Надання неточної інформації або надання такої інформації на
            вимогу Веб-сайту https://SushiRaketa.com.ua/ може бути приводом для
            призупинення надання послуг або продажу товару. При цьому Веб-сайт
            https://SushiRaketa.com.ua/ не несе відповідальності за будь-які
            збитки, заподіяні Покупцем у разі призупинення/невиконання послуг
            або продажу товару за умови невиконання пункту 12.1.
          </p>
          <p className={styles.text}>
            12.4. Продавець збирає та обробляє персональні дані Покупців (а
            саме: прізвище, {"ім'я"}, по батькові Покупця, адресу доставки;
            контактні телефони, адресу електронної пошти тощо) з метою:
          </p>
          <p className={styles.text}>- виконання умов цього Договору;</p>
          <p className={styles.text}>
            - Доставка Покупцеві замовленої ним продукції.
          </p>
          <p className={styles.text}>
            12.5. Здійснюючи Замовлення Товару через Веб-сайт
            https://SushiRaketa.com.ua/, Покупець дає згоду на збирання та
            обробку такої інформації.
          </p>
          <p className={styles.text}>
            12.6. Доступ до персональних даних Покупця мають лише особи, які
            безпосередньо залучені до виконання Замовлення.
          </p>
          <p className={styles.text}>
            12.7. Продавець {"зобов'язується"}: дотримуватися конфіденційності
            щодо персональних даних Покупців; не допускати спроб
            несанкціонованого використання персональних даних Покупців третіми
            особами; виключити доступ до персональних даних Покупців, осіб, які
            не мають безпосереднього відношення до виконання Заявки, крім
            випадків, передбачених чинним законодавством України.
          </p>
        </div>
      </section>
    </Layout>
  );
};

export default OfferContractView;
